个人信息
------------------------

- **Name** 黄 景 开
- <strong>Phone </strong> <a href="tel:13680315409" target="_top">136-803-154-09</a>
- <strong>Email </strong> <a href="mailto:qxsugar@gmail.com" target="_top">qxsugar@gmail.com</a>
- **School** [广东科学技术职业学院](http://www.gdit.edu.cn/)
- **工作时间**：2017.07 - NOW()
- **求职意向**：python后台开发，go后台开发，数据开发

教育经历
------------------------

1. 广东科学技术职业学院(2014-2017)
2. 北京师范大学 - 在考

个人主页
------------------------
[https://github.com/qxsugar](https://github.com/qxsugar)

技能清单
------------------------

1. 精通python开发，熟悉django，tornado，flask，celery，gevent等框架的底层工作原理。
1. 精通mysql，熟悉mysql的各种特性，有高并发C端后台开发经验，有大数据处理和大数据分析经验。
1. 熟悉go，熟悉go-gin框架，gorm等底层工作原理，常规go web开发等。
1. 熟悉hadoop，hive，presto等大数据框架和理念，从0到1搭建公司BI体系。
1. 熟悉k8s，helm等常规使用，有搭建k8s经验，集群问题排查经验，常规yaml配置使用经验。
1. 熟悉Centos，Ubuntu等Linux平台，能排查服务器问题，整理磁盘，定时任务，优化负载，发现异常问题。
1. 熟悉git，有git follow流程开发经验，熟悉git rebase操作。

**有独立开发能力，有产品分析能力，问题定位能力强**


工作经历
------------------------

### 柏妃科技有限公司 [2016.07-2018.12]

- 职位

  python后端开发工程师，python后端组组长

- 工作内容

  主要工作内容是基于ERP框架(Odoo)，为企业二次开发。 该框架底层基于werkzeug开发，我们的工作主要基于此写扩展，提供REST API给C端使用。
  该框架的优势是内置了很多企业需要的模块，强大的后台管理模块和快速开发API功能。 实现的功能包括如下
    1. 小区管理系统开发，包括报修，报废，维修等功能开发，审批流开发。视频，语音，图片等附件管理功能开发。
    2. 移动端Push功能开发，主要对接推送服务API，实现业务事件给C端推送事件功能。
    3. 基于Odoo的用户体系，我们开发了一套Facebook登陆模块，减少了用户注册问题。
    4. 对接指纹机系统，实现用户打卡记录回传，配合考勤模块，实现了考虑记录报表，工资自动结算等功能。
    5. 扩展Odoo的商城系统，使得在IPad上实现Pos系统，实现库存管理，商品管理，扫码枪，支付，结算等功能。

- 工作成果
    1. 从0到1调研Odoo系统，搭建Odoo开发环境，部署上线。
    1. 基于Odoo系统实现企业发票管理，物品报修，App推送通知等功能。
    1. 基于Odoo系统实现商城功能，Pos模块，支付功能，库存管理等功能。
    1. 基于Odoo系统实现企业打卡功能，员工管理，自动结算工资等功能。

**Odoo系统是一个很庞大的ERP系统，但是国内的开发经验很少，很多时候出现问题只能去看开发文档或者解析源码。虽然这个过程很痛苦，不过却学会了DEBUG基本功**

### 深圳小步网络科技 [2018.12 - 2019.11]

1. 职位

   python后端开发工程师

1. 工作内容

    1. 负责在4kw用户中找出有昵称和头像违规的用户并加入黑名单处理，采用ImageHash来获取图片Hash值，并通过计算Hash的相似度匹配，找出了这批目标用户。
    1. 负责服务集群跨地域迁移，负责维护迁移后的服务依赖稳定和mysql稳定迁移。
    1. 用户成长体系开发，加入用户任务系统，增加产品丰富度。
    1. mysql调优，对用户行为数据表进行按天分表，历史冷数据导入hive并删除冷表，减少mysql存储负担。
    1. 服务底层优化，为公司封装的mysql驱动增加ping操作，确保长时间不活跃的mysql链接异常导致业务异常。
    1. 处理高并发写导致死锁问题，对频繁写的接口采用celery异步处理，削峰处理。
    1. 优化mysql存储引擎，替换MyISam成Innodb，增加读写性能。
    1. celery异步刷新首页内容，给首页接口内容增加缓存处理，保证首页接口在高并发情况下的速度。
    1. go 推送项目重构，增加批量推送逻辑，支持高并发推送，推送记录分析等。

1. 工作成果
    1. 咨询内容爬虫程序优化，基于Bash调度，实现资源最大化利用。使得爬虫机器从126台缩减到64台，爬取内容从每天1w新增到稳定4w多篇
    1. 实现用户头像和昵称脱敏功能，防止用户使用官方头像和昵称去冒充官方账户。
    1. 用户成长体系开发，增加用户每日打卡任务等功能，增加用户的留存。
    1. mysql分库分表优化，对于行为数据按时间纬度分表，减少mysql的压力。
    1. 优化mysql，替换底层查询引擎为更高效的DBUtils，修复有mysql注入的sql代码。
    1. celery异步削峰处理，防止高峰时期导致api响应变慢
    1. 推送项目使用go重构，使得推送更加高效和及时。

**小步网络是越南资讯公司，旗下产品在越南Top3，主产品DUA更是达到百万级别，我负责的产品日活在30多万，用户200多万。工作很有挑战性，以至于现在遇到高并发场景都能做到不慌不忙**

### 荔枝微课 [2019.11 - 2021.04]

1. 职位

   数据开发工程师，技术经理

1. 工作内容

    1. 参与业务开发，埋点服务开发，事件服务开发，为AB TEST提供数据支持。
    1. 搭建数据同步系统，采用kafka-connect实时采集业务数据库，数据落库到pg的sink里，解决数据孤岛问题。
    1. 搭建大数据体系，采用云方案，搭建了公司的数据仓库系统，采用离线方式处理数据，为业务方提供指标。
    1. 负责财务报表开发，采用hive处理全年数据，提供准确的财务数据给财务审计使用。
    1. 负责基础建设开发，底层SDK开发(kotlin)，埋点sdk开发，参与微服务功能开发。
    1. 负责新业务开发，技术选型和基础建设，代码质量把控，项目质量把控，需求进度把控等。

1. 工作成果
    1. 从0到1搭建公司数仓平台，解决公司数据孤岛问题。
    1. 使用kotlin（spring）参与业务开发，开发了兰心听书馆小程序的api后台。
    1. 发现并解决业务存在并发情况下重复给用户的学分问题。
    1. 负责中台基础架构组开发，底层sdk开发，埋点sdk开发。
    1. 负责项目财务报表开发，辅助财务对账，(应收表，应付表，成本表，利润表等)。
    1. 负责新业务线的开发，技术选型和基础建设，代码review，需求分析等。

**在荔枝微课这段时间成长了好多，非技术类的能力得到了很大的成长**

其他项目经历
------------------------

#### 1. 云基平台开发

1. 后台采用go-gin开发，主要功能是记账处理，前台采用react，我负责后台开发和服务部署以及业务梳理。

#### 2. 精工平台开发

1. 后台主要采用go-gin + mysql开发，主要功能是分配试题，专家评估，生产评估报告，我负责后台开发以及服务部署。

#### 3. 物资管理系统开发

1. 该项目主要功能是物资管理。借用管理，库存管理，采用python django开发。我主要负责后台开发和服务部署。

自我评价
------------------------

1. 对新技术，新框架上手快。
2. 学习能力强，业余时间掌握k8s，go等常规使用。

求职意向
------------------------
想找稳定工作，不接受外包 

接受go开发，python开发，数据开发
